# PartMakerSplitterProfileFlipAlong Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PartMakerSplitterProfileFlipAlong Property
ParameterTypeId Class See Also
---
"Profile Along Flip"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PartMakerSplitterProfileFlipAlong { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartMakerSplitterProfileFlipAlong As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PartMakerSplitterProfileFlipAlong {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace